src/Catalogs/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Товары</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КаталогиТоваров</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСУП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьКоличества</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросКоличества</Name>
					<Comment>при подборе в заказ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтдельнойСтрокой</Name>
					<Comment>при упаковке заказа не сворачивать</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНаличияВПродаже</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНаличияВПродаже</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВПродаже</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВПродаже</Name>
					<Comment>по дням недели</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВПродажеВремя1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВПродажеВремя2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПечати</Name>
					<Comment>что печатать на чеке и счете</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выход</Name>
					<Comment>только для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэфПересчета</Name>
					<Comment>в номенклатуру</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаСпецифик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специфики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинУдельныйВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксУдельныйВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Comment>для установки произвольного порядка элементов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бонусы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоммутироемоеУстройство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоммутируемыеУстройства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Comment>разделитель в заказе (тарелка, упаковка)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПриготовления</Name>
					<Comment>в минутах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоГруппаЕдиниц</Name>
					<Comment>Внутри группы располагаются разные единицы одного и того же наименования</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКонтроляПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыКонтроляПродажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>фАлкоголь</Name>
					<Comment>1-алкоголь, 2- алкогольное пиво</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемБутылки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляМарки</Name>
					<Comment>короткое наименования для отображения в марке повара</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PLU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпецификиТипЭкранаГостя</Name>
					<Comment>0-стандарт 1 - INSPIRED 2 - не отображать</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КогдаВПродажеПоНеделям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнформационнаяБаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПонедельника</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КогдаВПродажеПоИБ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнформационнаяБаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьВПродаже</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродаже</Name>
							<Comment>по дням недели</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродажеВремя1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродажеВремя2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РеестрЦен</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеестрЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВариантыНаличияВПродаже.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВариантыНаличияВПродаже</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Простой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сложный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойПоИБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СложныйПоИБ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тариф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Абонемент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Товары/Forms/ФормаЭлемента/module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЧЕЕ


Процедура ПрочитатьЦены(ТоварСсылка)

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ТипыЦен.Ссылка КАК ТипЦен,
	|	ЦеныНоменклатурыСрезПоследних.Период КАК ДатаИзменения,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.Валюта КАК Валюта
	|ИЗ
	|	Справочник.ТипыЦен КАК ТипыЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦен, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО (ЦеныНоменклатурыСрезПоследних.ТипЦен = ТипыЦен.Ссылка)
	|ГДЕ
	|	НЕ ТипыЦен.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипыЦен.Наименование");
		
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ДатаЦен", ДатаЦен);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ТаблицаЦен.Очистить();
	
	Пока Выборка.Следующий() Цикл
	
		СтрокаЦен = ТаблицаЦен.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЦен, Выборка);
		
		Если НЕ ЗначениеЗаполнено(СтрокаЦен.Валюта) Тогда
			СтрокаЦен.Валюта = Константы.ОсновнаяВалюта.Получить()
		КонецЕсли; 
		
		Если СтрокаЦен.ТипЦен = ОсновнойТипЦен Тогда
			Цена 			= СтрокаЦен.Цена;
			ВалютаЦены   	= СтрокаЦен.Валюта;
			
		ИначеЕсли СтрокаЦен.ТипЦен = Справочники.ТипыЦен.Себестоимость Тогда
			Себестоимость 		= СтрокаЦен.Цена;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗаписатьЦены()

	//Для каждого СтрокаЦен Из ТаблицаЦен Цикл
	//	
	//	Если СтрокаЦен.ДатаИзменения <> ДатаЦен Тогда
	//		Продолжить;
	//	КонецЕсли; 
	//	
	//	РегистрЦены = РегистрыСведений.ЦеныНоменклатуры.СоздатьМенеджерЗаписи();
	//	РегистрЦены.Номенклатура	= Номенклатура;
	//	РегистрЦены.Период	= СтрокаЦен.ДатаИзменения;
	//	РегистрЦены.ТипЦен	= СтрокаЦен.ТипЦен;
	//	РегистрЦены.Цена	= СтрокаЦен.Цена;
	//	РегистрЦены.Валюта  = СтрокаЦен.Валюта;
	//	Попытка
	//		РегистрЦены.Записать();
	//	Исключение
	//		Сообщить(ОписаниеОшибки());
	//	КонецПопытки;
	//	
	//КонецЦикла; 

КонецПроцедуры
 
Процедура УстановитьЦенуВТаблице(ТипЦен, ИмяЦены, Значение)

	СтрокаЦен = ТаблицаЦен.Найти(ТипЦен, "ТипЦен");
	Если СтрокаЦен <> Неопределено Тогда
		СтрокаЦен[ИмяЦены] = Значение;
		СтрокаЦен.ДатаИзменения = ДатаЦен;
	КонецЕсли; 
	
КонецПроцедуры
 
Процедура ПриИзмененииВариантНаличия()
	
	Если ВариантНаличияВПродаже = Перечисления.ВариантыНаличияВПродаже.Сложный Тогда
		ЭлементыФормы.ДействующиеРасписания.Видимость = истина;
		//ЭлементыФормы.ЕстьВпродаже.Видимость = ложь;
		
	Иначе		
		ЭлементыФормы.ДействующиеРасписания.Видимость = ложь;
		//ЭлементыФормы.ЕстьВпродаже.Видимость = истина;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	УправлениеРИБ.ПередОткрытиемЭлементаСправочника(ЭтотОбъект, ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ЭлементыФормы.стрВладелец.Заголовок = ""+Владелец;
	
	Если ЭтоНовый() Тогда
		Если ЗначениеЗаполнено(ПараметрОбъектКопирования) Тогда
		Иначе
			Если ЗначениеЗаполнено(Родитель) Тогда
				ЕдиницаИзмерения= Родитель.ЕдиницаИзмерения;
				Категория		= Родитель.Категория;
				ГруппаПечати	= Родитель.ГруппаПечати;
				Если Родитель.ЭтоГруппаЕдиниц Тогда
					Наименование  = Родитель.Наименование;
					ДопИнформация = Родитель.ДопИнформация;
				КонецЕсли;
			Иначе
				ЕдиницаИзмерения=Константы.ОсновнаяЕдиницаИзмерения.Получить();
				Категория       =Константы.ОсновнаяКатегорияТоваров.Получить();
			КонецЕсли;
			
			ЕстьВПродаже  = Истина;
			ВариантПечати = 511;	// все колонки
			КратностьКоличества=1;
			
			Если глВерсия=3 Тогда
				Тип = Перечисления.ТипыТоваров.Товар;
			КонецЕсли; 
			
		КонецЕсли; 
		
		Изображение = Неопределено;
	КонецЕсли; 
	
	ОсновнойТипЦен	= ИнтерфейсАдмина.ПолучитьОсновнойТипЦен();
	ДатаЦен			= ТекущаяДата();
	ПрочитатьЦены( ?(ЗначениеЗаполнено(ПараметрОбъектКопирования), ПараметрОбъектКопирования, Ссылка) );
	
	ИнтерфейсАдмина.ЗаполнитьСписокЧтоПечататьВСчете(СписокКолонкиПечати, ВариантПечати);
	
	СписокВыбора = ЭлементыФормы.ВариантНаличияВПродаже.СписокВыбора;
	СписокВыбора.Добавить(Перечисления.ВариантыНаличияВПродаже.Простой);
	СписокВыбора.Добавить(Перечисления.ВариантыНаличияВПродаже.Сложный);
	
	ПриИзмененииВариантНаличия();
	
	СправочникСписокШтрихКоды.Отбор.Товар.Установить(Ссылка);
	
	Если НЕ Изображение.Пустая() Тогда
		ЭлементыФормы.Изображение.Картинка = Изображение.Хранилище.Получить();
	КонецЕсли; 
	
	Если глВерсия=1 ИЛИ НЕ Константы.ДопЯзыки.Получить() Тогда
		ЭлементыФормы.ПанельОсновная.Страницы.ДопНаименования.Видимость = Ложь;
	Иначе
		Если НЕ ЗначениеЗаполнено(ПараметрОбъектКопирования) Тогда
			ИнтерфейсАдмина.ЗаполнитьДопНаименования(Ссылка,ТаблицаДопНаименования);
		Иначе
			ИнтерфейсАдмина.ЗаполнитьДопНаименования(ПараметрОбъектКопирования,ТаблицаДопНаименования);
		КонецЕсли;
	КонецЕсли;
	
	Если глВерсия<3 Тогда
		ЭлементыФормы.Тип.Видимость = Ложь;
		ЭлементыФормы.НадписьТип.Видимость = Ложь;
	КонецЕсли; 
	
	Попытка
		ЭлементыФормы.ПанельОсновная.ТекущаяСтраница = ЭлементыФормы.ПанельОсновная.Страницы[ВосстановитьЗначение("ТекущаяСтраницаТовары")];
	Исключение
	КонецПопытки;
	
	ИнтерфейсАдмина.ЗаполнитьПодменюВыбораОтчетов(ЭтотОбъект, ЭлементыФормы.ДействияФормы.Кнопки.ПодменюОтчеты);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	СохранитьЗначение("ТекущаяСтраницаТовары", ЭлементыФормы.ПанельОсновная.ТекущаяСтраница.Имя);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ВариантПечати = ИнтерфейсАдмина.СписокПометокВЧисло(СписокКолонкиПечати);
	
	Если глВерсия>1 Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ГруппаСпецифик) Тогда
			ЭтотОбъект.МинУдельныйВес = 0;
			ЭтотОбъект.МаксУдельныйВес = 0;
		ИначеЕсли ЭтотОбъект.МаксУдельныйВес < ЭтотОбъект.МинУдельныйВес Тогда
			ЭтотОбъект.МаксУдельныйВес = ЭтотОбъект.МинУдельныйВес
		КонецЕсли;
	КонецЕсли; 
	
	Если глВерсия=3 Тогда
		Если ЭтотОбъект.Тип=Перечисления.ТипыТоваров.Тариф Тогда
			ОтдельнойСтрокой = Истина;
			Разделитель = Ложь;
		Иначе
			Тариф = Неопределено;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если Разделитель Тогда
		ЗапросКоличества = Ложь;
		КратностьКоличества = 1;
	КонецЕсли; 
	
	//СпецификиТипЭкранаГостя = стандарт - 1;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ИнтерфейсАдмина.ЗаписатьДопНаименования(Ссылка,ТаблицаДопНаименования);
	
	Если НЕ(глВерсия=3 И ЭтотОбъект.Тип=Перечисления.ТипыТоваров.Тариф) Тогда
		ЗаписатьЦены();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПослеЗаписи()
	
	СправочникСписокШтрихКоды.Отбор.Товар.Установить(Ссылка);
	ДействующиеРасписания.Отбор.Объект.Установить(Ссылка);	
КонецПроцедуры

Процедура ОбработкаВыбора(ЗначениеВыбора, Источник)
	
	Если ТипЗнч(ЗначениеВыбора) = Тип("СправочникСсылка.ХранилищеДополнительнойИнформации") Тогда
		Если НЕ Изображение = ЗначениеВыбора Тогда
			Изображение = ЗначениеВыбора;
		КонецЕсли;
		
		ЭлементыФормы.Изображение.Картинка = Изображение.Хранилище.Получить();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	ЭтоТариф	 = глВерсия=3 И ЭтотОбъект.Тип=Перечисления.ТипыТоваров.Тариф;
	
	ЭлементыФормы.ПанельОсновная.Страницы.Цены		.Видимость = НЕ ЭтоТариф И ТаблицаЦен.Количество()>2;
	
	ТекущаяСтраница = ЭлементыФормы.ПанельОсновная.ТекущаяСтраница;
	
	Если ТекущаяСтраница = ЭлементыФормы.ПанельОсновная.Страницы.Основное Тогда
		
		Если ЭтоТариф Тогда
			ЭлементыФормы.ПанельЦенаТариф.ТекущаяСтраница = ЭлементыФормы.ПанельЦенаТариф.Страницы.Тариф;
		Иначе
			ЭлементыФормы.ПанельЦенаТариф.ТекущаяСтраница = ЭлементыФормы.ПанельЦенаТариф.Страницы.Цена;
		КонецЕсли; 
		
		Флаг = ЗначениеЗаполнено(Номенклатура);
		ЭлементыФормы.НадписьКоэфПересчета.Доступность	= Флаг;
		ЭлементыФормы.КоэфПересчета.Доступность			= Флаг;
		Если Флаг И ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
			ЭлементыФормы.ИнфНадписьКоэффициент.Заголовок = ЕдиницаИзмерения.Наименование+" = "+КоэфПересчета+" * "+Номенклатура.БазоваяЕдиницаИзмерения;
		Иначе
			ЭлементыФормы.ИнфНадписьКоэффициент.Заголовок = "";
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница = ЭлементыФормы.ПанельОсновная.Страницы.ПараметрыДляЗаказа Тогда
		
		Если глВерсия>1 Тогда
			Флаг = ЗначениеЗаполнено(ЭтотОбъект.ГруппаСпецифик);
			ЭлементыФормы.НадписьМинУдельныйВес	.Доступность = Флаг;
			ЭлементыФормы.МинУдельныйВес		.Доступность = Флаг;
			ЭлементыФормы.МаксУдельныйВес		.Доступность = Флаг;
		КонецЕсли; 
		
		Если глВерсия=3 Тогда
			ЭлементыФормы.ПанельПараметрыПодбора.Видимость = ЭтотОбъект.Тип=Перечисления.ТипыТоваров.Товар;
		КонецЕсли; 
		
		Если ЭлементыФормы.ПанельПараметрыПодбора.Видимость Тогда
			ЭлементыФормы.ОтдельнойСтрокой			.Видимость = НЕ ЭтотОбъект.Разделитель;
			ЭлементыФормы.ЗапросКоличества			.Видимость = НЕ ЭтотОбъект.Разделитель;
			ЭлементыФормы.КратностьКоличества		.Видимость = НЕ ЭтотОбъект.Разделитель;
			ЭлементыФормы.НадписьКратностьКоличества.Видимость = НЕ ЭтотОбъект.Разделитель;
		КонецЕсли; 
				
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
Процедура ВариантНаличияВПродажеПриИзменении(Элемент)
	
	ПриИзмененииВариантНаличия();
	
КонецПроцедуры

Процедура ВариантНаличияВПродажеОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура ПанельОсновнаяПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ОбновлениеОтображения();
КонецПроцедуры

Процедура ИзображениеНажатие(Элемент)
	
	ХранилищеДополнительнойИнформации.ОткрытьФормуИзображения(ЭтаФорма, Изображение);
	
КонецПроцедуры

Процедура КоманднаяПанельКолонкиПечатиУстановитьФлажки(Кнопка)
	
	СписокКолонкиПечати.ЗаполнитьПометки(Истина);
	
КонецПроцедуры

Процедура КоманднаяПанельКолонкиПечатиСнятьФлажки(Кнопка)
	
	СписокКолонкиПечати.ЗаполнитьПометки(Ложь);
	
КонецПроцедуры

Процедура ШтрихКодыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа)
	
	Отказ = Истина;
	
	Если ЭтоНовый() Тогда
		Предупреждение("Необходимо записать элемент!",5);
		Возврат;
	КонецЕсли;
	
	ФормаШК = Справочники.ШтрихКоды.ПолучитьФормуНовогоЭлемента(, Элемент);
	ФормаШК.Товар = Ссылка;
	ФормаШК.Открыть();
	
КонецПроцедуры

Процедура ШтрихКодыОбработкаЗаписиНовогоОбъекта(Элемент, Объект, СтандартнаяОбработка)
	
	Если Объект.Товар = Ссылка Тогда
		ЭлементыФормы.ШтрихКоды.ТекущаяСтрока = Объект;
	КонецЕсли; 
	
КонецПроцедуры

Процедура МинУдельныйВесПриИзменении(Элемент)
	
	Если ЭтотОбъект.МаксУдельныйВес < ЭтотОбъект.МинУдельныйВес Тогда
		ЭтотОбъект.МаксУдельныйВес = ЭтотОбъект.МинУдельныйВес
	КонецЕсли; 
	
КонецПроцедуры

Процедура МаксУдельныйВесПриИзменении(Элемент)
	
	Если ЭтотОбъект.МаксУдельныйВес < ЭтотОбъект.МинУдельныйВес Тогда
		ЭтотОбъект.МинУдельныйВес = ЭтотОбъект.МаксУдельныйВес
	КонецЕсли; 
	
КонецПроцедуры

Процедура СкидкаНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтерфейсАдмина.ВыборСкидкиБонуса(Элемент, Ложь);
	
КонецПроцедуры

Процедура БонусыНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтерфейсАдмина.ВыборСкидкиБонуса(Элемент, Истина);
	
КонецПроцедуры

Процедура ДатаЦенПриИзменении(Элемент)
	
	ПрочитатьЦены(Ссылка);
	
КонецПроцедуры

Процедура ЦенаПриИзменении(Элемент)
	
	УстановитьЦенуВТаблице(ОсновнойТипЦен, "Цена", Элемент.Значение);
	
КонецПроцедуры


Процедура СебестоимостьПриИзменении(Элемент)
	
	УстановитьЦенуВТаблице(Справочники.ТипыЦен.Себестоимость, "Цена", Элемент.Значение);
	
КонецПроцедуры

Процедура ТаблицаЦенПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаЦен = Элемент.ТекущаяСтрока;
	СтрокаЦен.ДатаИзменения = ДатаЦен;
	
	Если СтрокаЦен.ТипЦен = ОсновнойТипЦен Тогда
		Цена 			= СтрокаЦен.Цена;
		ВалютаЦены   	= СтрокаЦен.Валюта;
		
	ИначеЕсли СтрокаЦен.ТипЦен = Справочники.ТипыЦен.Себестоимость Тогда
		Себестоимость 		= СтрокаЦен.Цена;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ТаблицаЦенПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если ДанныеСтроки.ТипЦен = ОсновнойТипЦен Тогда
		ОформлениеСтроки.Шрифт = Новый Шрифт(,,Истина);	// жирный
		
	ИначеЕсли ДанныеСтроки.ТипЦен = Справочники.ТипыЦен.Себестоимость Тогда
		ОформлениеСтроки.ЦветТекста = Новый Цвет(153,51,0);		// бардовый
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНДНОЙ ПАНЕЛИ ФОРМЫ

// Процедура назначается динамически
// Процедура вызывается при выборе пункта подменю ПодменюОтчеты командной панели
// формы. Процедура отрабатывает выбор печатной формы.
// Подключение данной процедуры-обработчика выполняется из кода конфигурации
//
Процедура ДействияФормыДействиеВыбратьОтчет(Кнопка) 
	
	Если Кнопка <> Неопределено Тогда // найти новое значение вида операции
		СписокОтчетов = ПолучитьСписокОтчетов();
		СтрокаОтчетаВСписке = СписокОтчетов.НайтиПоЗначению(Кнопка.Имя);
		Если СтрокаОтчетаВСписке <> Неопределено Тогда
			СформироватьОтчет(СтрокаОтчетаВСписке.Значение, ЭтотОбъект);
		Иначе
			СсылкаНаОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду(СтрЗаменить(Кнопка.Имя, "ВнешнийОтчет_", ""));
			
			Если СсылкаНаОтчет <> Неопределено Тогда
				СформироватьОтчет(СсылкаНаОтчет, ЭтотОбъект);
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НоменклатураПриИзменении(Элемент)
	КодСУП = Номенклатура.КодСУП;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОСНОВНОЕ ТЕЛО МОДУЛЯ

ДействующиеРасписания.Отбор.Объект.Установить(Ссылка);
